【回顾&引言】前面一章的内容大家可以感觉到我们主要是对基础知识做一个梳理，让大家了解数据分析的一些操作，主要做了数据的各个角度的观察。那么在这里，我们主要是做数据分析的流程性学习，主要是包括了数据清洗以及数据的特征处理，数据重构以及数据可视化。这些内容是为数据分析最后的建模和模型评价做一个铺垫。

#### 开始之前，导入numpy、pandas包和数据

In [1]:
#加载所需的库
import pandas as pd
import numpy as np

In [2]:
#加载数据train.csv
dft=pd.read_csv('train.csv')
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 2 第二章：数据清洗及特征处理
我们拿到的数据通常是不干净的，所谓的不干净，就是数据中有缺失值，有一些异常点等，需要经过一定的处理才能继续做后面的分析或建模，所以拿到数据的第一步是进行数据清洗，本章我们将学习缺失值、重复值、字符串和数据转换等操作，将数据清洗成可以分析或建模的亚子。

### 2.1 缺失值观察与处理
我们拿到的数据经常会有很多缺失值，比如我们可以看到Cabin列存在NaN，那其他列还有没有缺失值，这些缺失值要怎么处理呢

#### 2.1.1 任务一：缺失值观察
(1) 请查看每个特征缺失值个数  
(2) 请查看Age， Cabin， Embarked列的数据
以上方式都有多种方式，所以大家多多益善

In [4]:
#写入代码
dft.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
dft.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
#写入代码
dft[['Age','Cabin','Embarked']]

      Age Cabin Embarked
0    22.0   NaN        S
1    38.0   C85        C
2    26.0   NaN        S
3    35.0  C123        S
4    35.0   NaN        S
..    ...   ...      ...
886  27.0   NaN        S
887  19.0   B42        S
888   NaN   NaN        S
889  26.0  C148        C
890  32.0   NaN        Q

[891 rows x 3 columns]

#### 2.1.2 任务二：对缺失值进行处理
(1)处理缺失值一般有几种思路
删除或填充
(2) 请尝试对Age列的数据的缺失值进行处理
dropna,bfill,fillna,ffill
(3) 请尝试使用不同的方法直接对整张表的缺失值进行处理

## 处理Age行

In [10]:
#处理缺失值的一般思路：
#提醒：可使用的函数有--->dropna函数与fillna函数
dft.dropna(how='any',subset=['Age'])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [11]:
#写入代码
dft.fillna({'Age':10})

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,10.0,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [14]:
#写入代码
dft['Age'].fillna(method='bfill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    26.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [15]:
#写入代码
dft['Age'].fillna(dft['Age'].mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [16]:
dft['Age'].bfill()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    26.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

## 处理整个表

In [17]:
dft.fillna(dft.mean())

/var/folders/q7/clhz60qx71g5zl4d_1tb09bm0000gn/T/ipykernel_1313/2833198370.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dft.fillna(dft.mean())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [20]:
dft.fillna(method='ffill',axis=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C123,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,C50,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,19.0,1,2,W./C. 6607,23.4500,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,C148,Q

In [21]:
dft.fillna(method='bfill',axis=0,limit=2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C85,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C123,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,E46,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,B42,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,26.0,1,2,W./C. 6607,23.4500,C148,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
? dft.fillna

【思考1】dropna和fillna有哪些参数，分别如何使用呢?

【思考】检索空缺值用`np.nan`,`None`以及`.isnull()`哪个更好，这是为什么？如果其中某个方式无法找到缺失值，原因又是为什么？

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

### 2.2 重复值观察与处理
由于这样那样的原因，数据中会不会存在重复值呢，如果存在要怎样处理呢

#### 2.2.1 任务一：请查看数据中的重复值

In [27]:
#写入代码
dft[dft.duplicated()]
#keep: 标记哪个重复数据，默认为‘first’。1.‘first’：标记重复数据第一次出现为True;‘last’：标记重复数据最后一次出现为True；False:标记所有重复数据为True。

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

#### 2.2.2 任务二：对重复值进行处理
(1)重复值有哪些处理方式呢？

(2)处理我们数据的重复值

方法多多益善

In [28]:
#重复值有哪些处理方式：
dft=dft.drop_duplicates()
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

####  2.2.3 任务三：将前面清洗的数据保存为csv格式

In [29]:
#写入代码
dft=dft.fillna(dft.mode())

In [30]:
dft.to_csv('cleaned_train.csv')

### 2.3 特征观察与处理
我们对特征进行一下观察，可以把特征大概分为两大类：  
数值型特征：Survived ，Pclass， Age ，SibSp， Parch， Fare，其中Survived， Pclass为离散型数值特征，Age，SibSp， Parch， Fare为连续型数值特征  
文本型特征：Name， Sex， Cabin，Embarked， Ticket，其中Sex， Cabin， Embarked， Ticket为类别型文本特征，数值型特征一般可以直接用于模型的训练，但有时候为了模型的稳定性及鲁棒性会对连续变量进行离散化。文本型特征往往需要转换成数值型特征才能用于建模分析。

#### 2.3.1 任务一：对年龄进行分箱（离散化）处理
(1) 分箱操作是什么？

(2) 将连续变量Age平均分箱成5个年龄段，并分别用类别变量12345表示  

(3) 将连续变量Age划分为[0,5) [5,15) [15,30) [30,50) [50,80)五个年龄段，并分别用类别变量12345表示  

(4) 将连续变量Age按10% 30% 50% 70% 90%五个年龄段，并用分类变量12345表示

(5) 将上面的获得的数据分别进行保存，保存为csv格式

In [32]:
#分箱操作是什么：
dft['Age(2)']=pd.cut(dft['Age'], 5, labels=[1,2,3,4,5])
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age(2)
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B96 B98,S,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,G6,S,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3

In [ ]:
#写入代码

dft['Age(2)']=pd.cut(dft['Age'], 5, labels=[1,2,3,4,5])
dft.head()

In [33]:
dft.to_csv('dft_cut1.csv')

In [34]:
#写入代码
dft['Age(2)']=pd.cut(dft['Age'],[0,5,15,30,50,80],labels = [1,2,3,4,5])
dft.to_csv('dft_cut2.csv')

In [37]:
#写入代码

dft['Age(2)']=pd.qcut(dft['Age'],[0,0.1,0.3,0.5,0.7,0.9],labels=[1,2,3,4,5])
dft.to_csv("df_cutp.csv")

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html

【参考】https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html

#### 2.3.2 任务二：对文本变量进行转换
(1) 查看文本变量名及种类  
(2) 将文本变量Sex， Cabin ，Embarked用数值变量12345表示  
(3) 将文本变量Sex， Cabin， Embarked用one-hot编码表示

In [45]:
#写入代码
object_columns = dft.select_dtypes(include=['object']).columns
dft[object_columns].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      891 non-null    object
 1   Sex       891 non-null    object
 2   Ticket    891 non-null    object
 3   Cabin     206 non-null    object
 4   Embarked  889 non-null    object
dtypes: object(5)
memory usage: 41.8+ KB

In [46]:
#写入代码
dft['Sex'].unique()

array(['male', 'female'], dtype=object)

In [47]:
#写入代码
dft['Cabin'].unique()

array(['B96 B98', 'C85', 'G6', 'C123', nan, 'E46', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'E10', 'E44', 'A34',
       'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14', 'B37',
       'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38', 'B39',
       'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68', 'B41',
       'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48', 'E58',
       'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [48]:
dft['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [50]:
from sklearn.preprocessing import LabelEncoder
for feat in ['Sex','Cabin','Embarked']:
    encoder= LabelEncoder().fit(dft[feat].ffill())
    dft[feat+"labelencode"] = encoder.transform(dft[feat].ffill())
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age(2),Sexlabelencode,Cabinlabelencode,Embarkedlabelencode
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B96 B98,S,2,1,47,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,5,0,81,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,G6,S,3,0,145,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,55,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,4,1,55,2

In [52]:
dft[feat]

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [90]:
from  sklearn.preprocessing import  OneHotEncoder
enc=OneHotEncoder()
enc=enc.fit(dft[['Sex','Cabin','Embarked']].fillna(dft[['Sex','Cabin','Embarked']].mode()))
# after_onehot_features = load_onehot_model.get_feature_names(onehot_features)
# data_test_onehot = pd.DataFrame(load_onehot_model.transform(data_test[onehot_features]).toarray(),columns=after_onehot_features)

In [91]:
cats=enc.categories_

In [92]:
cats[1][0]

'A10'

In [98]:
onehot=enc.transform(dft[['Sex','Cabin','Embarked']]).toarray()

In [96]:
colms=[]
for i,c in enumerate(['Sex','Cabin','Embarked']):
    for f in cats[i]:
        colms.append(str(c)+"_feature_"+str(f))

In [97]:
colms

['Sex_feature_female',
 'Sex_feature_male',
 'Cabin_feature_A10',
 'Cabin_feature_A14',
 'Cabin_feature_A16',
 'Cabin_feature_A19',
 'Cabin_feature_A20',
 'Cabin_feature_A23',
 'Cabin_feature_A24',
 'Cabin_feature_A26',
 'Cabin_feature_A31',
 'Cabin_feature_A32',
 'Cabin_feature_A34',
 'Cabin_feature_A36',
 'Cabin_feature_A5',
 'Cabin_feature_A6',
 'Cabin_feature_A7',
 'Cabin_feature_B101',
 'Cabin_feature_B102',
 'Cabin_feature_B18',
 'Cabin_feature_B19',
 'Cabin_feature_B20',
 'Cabin_feature_B22',
 'Cabin_feature_B28',
 'Cabin_feature_B3',
 'Cabin_feature_B30',
 'Cabin_feature_B35',
 'Cabin_feature_B37',
 'Cabin_feature_B38',
 'Cabin_feature_B39',
 'Cabin_feature_B4',
 'Cabin_feature_B41',
 'Cabin_feature_B42',
 'Cabin_feature_B49',
 'Cabin_feature_B5',
 'Cabin_feature_B50',
 'Cabin_feature_B51 B53 B55',
 'Cabin_feature_B57 B59 B63 B66',
 'Cabin_feature_B58 B60',
 'Cabin_feature_B69',
 'Cabin_feature_B71',
 'Cabin_feature_B73',
 'Cabin_feature_B77',
 'Cabin_feature_B78',
 'Cabin_feature_B79',
 'Cabin_feature_B80',
 'Cabin_feature_B82 B84',
 'Cabin_feature_B86',
 'Cabin_feature_B94',
 'Cabin_feature_B96 B98',
 'Cabin_feature_C101',
 'Cabin_feature_C103',
 'Cabin_feature_C104',
 'Cabin_feature_C106',
 'Cabin_feature_C110',
 'Cabin_feature_C111',
 'Cabin_feature_C118',
 'Cabin_feature_C123',
 'Cabin_feature_C124',
 'Cabin_feature_C125',
 'Cabin_feature_C126',
 'Cabin_feature_C128',
 'Cabin_feature_C148',
 'Cabin_feature_C2',
 'Cabin_feature_C22 C26',
 'Cabin_feature_C23 C25 C27',
 'Cabin_feature_C30',
 'Cabin_feature_C32',
 'Cabin_feature_C45',
 'Cabin_feature_C46',
 'Cabin_feature_C47',
 'Cabin_feature_C49',
 'Cabin_feature_C50',
 'Cabin_feature_C52',
 'Cabin_feature_C54',
 'Cabin_feature_C62 C64',
 'Cabin_feature_C65',
 'Cabin_feature_C68',
 'Cabin_feature_C7',
 'Cabin_feature_C70',
 'Cabin_feature_C78',
 'Cabin_feature_C82',
 'Cabin_feature_C83',
 'Cabin_feature_C85',
 'Cabin_feature_C86',
 'Cabin_feature_C87',
 'Cabin_feature_C90',
 'Cabin_feature_C91',
 'Cabin_feature_C92',
 'Cabin_feature_C93',
 'Cabin_feature_C95',
 'Cabin_feature_C99',
 'Cabin_feature_D',
 'Cabin_feature_D10 D12',
 'Cabin_feature_D11',
 'Cabin_feature_D15',
 'Cabin_feature_D17',
 'Cabin_feature_D19',
 'Cabin_feature_D20',
 'Cabin_feature_D21',
 'Cabin_feature_D26',
 'Cabin_feature_D28',
 'Cabin_feature_D30',
 'Cabin_feature_D33',
 'Cabin_feature_D35',
 'Cabin_feature_D36',
 'Cabin_feature_D37',
 'Cabin_feature_D45',
 'Cabin_feature_D46',
 'Cabin_feature_D47',
 'Cabin_feature_D48',
 'Cabin_feature_D49',
 'Cabin_feature_D50',
 'Cabin_feature_D56',
 'Cabin_feature_D6',
 'Cabin_feature_D7',
 'Cabin_feature_D9',
 'Cabin_feature_E10',
 'Cabin_feature_E101',
 'Cabin_feature_E12',
 'Cabin_feature_E121',
 'Cabin_feature_E17',
 'Cabin_feature_E24',
 'Cabin_feature_E25',
 'Cabin_feature_E31',
 'Cabin_feature_E33',
 'Cabin_feature_E34',
 'Cabin_feature_E36',
 'Cabin_feature_E38',
 'Cabin_feature_E40',
 'Cabin_feature_E44',
 'Cabin_feature_E46',
 'Cabin_feature_E49',
 'Cabin_feature_E50',
 'Cabin_feature_E58',
 'Cabin_feature_E63',
 'Cabin_feature_E67',
 'Cabin_feature_E68',
 'Cabin_feature_E77',
 'Cabin_feature_E8',
 'Cabin_feature_F E69',
 'Cabin_feature_F G63',
 'Cabin_feature_F G73',
 'Cabin_feature_F2',
 'Cabin_feature_F33',
 'Cabin_feature_F38',
 'Cabin_feature_F4',
 'Cabin_feature_G6',
 'Cabin_feature_T',
 'Cabin_feature_nan',
 'Embarked_feature_C',
 'Embarked_feature_Q',
 'Embarked_feature_S',
 'Embarked_feature_nan']

In [99]:
onehotdf=pd.DataFrame(onehot,columns=colms)

In [100]:
onehotdf

,Sex_feature_female,Sex_feature_male,Cabin_feature_A10,Cabin_feature_A14,Cabin_feature_A16,Cabin_feature_A19,Cabin_feature_A20,Cabin_feature_A23,Cabin_feature_A24,Cabin_feature_A26,...,Cabin_feature_F33,Cabin_feature_F38,Cabin_feature_F4,Cabin_feature_G6,Cabin_feature_T,Cabin_feature_nan,Embarked_feature_C,Embarked_feature_Q,Embarked_feature_S,Embarked_feature_nan
0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
1,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
2,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0
3,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
4,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0
887,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
888,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0
889,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
890,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0

#### 2.3.3 任务三：从纯文本Name特征里提取出Titles的特征(所谓的Titles就是Mr,Miss,Mrs等)

In [72]:
#写入代码
dft['Title'] = dft.Name.str.extract('([A-Za-z]+)\.', expand=False)
dft.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age(2),Sexlabelencode,Cabinlabelencode,Embarkedlabelencode,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,B96 B98,S,2,1,47,2,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,5,0,81,0,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,G6,S,3,0,145,2,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4,0,55,2,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,4,1,55,2,Mr

In [ ]:
#保存最终你完成的已经清理好的数据